/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.af.afa.definition.core.enumeratedtype;

/**
 * 選挙人名簿抄本を表す列挙型です。
 *
 */
public enum MeiboShohonConfigKeys {

    /**
     * 抄本_印字有無_投票区名
     */
    抄本_印字有無_投票区名,
    /**
     * 抄本_住所編集_ヘッダ部住所
     */
    抄本_住所編集_ヘッダ部住所,
    /**
     * 抄本_住所編集_住所欄出力内容
     */
    抄本_住所編集_住所欄出力内容,
    /**
     * 抄本_住所編集_方書印字有無
     */
    抄本_住所編集_方書印字有無,
    /**
     * 抄本_印字有無_生年月日
     */
    抄本_印字有無_生年月日,
    /**
     * 抄本_印字有無_世帯主区分
     */
    抄本_印字有無_世帯主区分,
    /**
     * 抄本_印字有無_カナ名称
     */
    抄本_印字有無_カナ名称,
    /**
     * 抄本_印字有無_識別コード
     */
    抄本_印字有無_識別コード,
    /**
     * 抄本_公民権停止文字
     */
    抄本_公民権停止文字,
    /**
     * 抄本_印字有無_日付
     */
    抄本_印字有無_日付,
    /**
     * 抄本_印字有無_転出先名
     */
    抄本_印字有無_転出先名,
    /**
     * 抄本_印字有無_抹消者抹消線
     */
    抄本_印字有無_抹消者抹消線,
    /**
     * 抄本_印字有無_二重登録時抹消線
     */
    抄本_印字有無_二重登録時抹消線,
    /**
     * 抄本_受付欄編集_印字有無_投票不可情報
     */
    抄本_受付欄編集_印字有無_投票不可情報,
    /**
     * 抄本_受付欄編集_印字有無_不在者交付済
     */
    抄本_受付欄編集_印字有無_不在者交付済,
    /**
     * 抄本_受付欄編集_印字有無_一部投票済
     */
    抄本_受付欄編集_印字有無_一部投票済,
    /**
     * 抄本_グループコード
     */
    抄本_グループコード,
    /**
     * 抄本_冊区分管理
     */
    抄本_冊区分管理,
    /**
     * 在外_国外分類コード
     */
    在外_国外分類コード;
}
